In [1]:
person = {
    "first": "kaushal", 
    "last": "pandey", 
    "email": "kaushalpandey@gmail.com"
}

In [3]:
person['email']

'CoreyMSchafer@gmail.com'

In [4]:
people = {
    "first": ["kaushal"], 
    "last": ["pandey"], 
    "email": ["kaushalpandey@gmail.com"]
}

In [5]:
people = {
    "first": ["kaushal", 'kaushal', 'kaushal'], 
    "last": ["pandey", 'pandey', 'pandey'], 
    "email": ["kaushalpandey@gmail.com", 'kaushalpandey@gmail.com', 'kaushalpandey@gmail.com']
}

In [7]:
people['first']

['kaushal', 'kaushal', 'kaushal']

In [8]:
import pandas as pd

In [9]:
df = pd.DataFrame(people)
df

     first    last                    email
0  kaushal  pandey  kaushalpandey@gmail.com
1  kaushal  pandey  kaushalpandey@gmail.com
2  kaushal  pandey  kaushalpandey@gmail.com

In [10]:
df['email']

0    kaushalpandey@gmail.com
1    kaushalpandey@gmail.com
2    kaushalpandey@gmail.com
Name: email, dtype: object

In [11]:
df.email

0    kaushalpandey@gmail.com
1    kaushalpandey@gmail.com
2    kaushalpandey@gmail.com
Name: email, dtype: object

In [13]:
df[['last', 'email']]

     last                    email
0  pandey  kaushalpandey@gmail.com
1  pandey  kaushalpandey@gmail.com
2  pandey  kaushalpandey@gmail.com

In [14]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [18]:
df.iloc[0] #for printing row

first                    kaushal
last                      pandey
email    kaushalpandey@gmail.com
Name: 0, dtype: object

In [20]:
df.iloc[[0, 1,2]] #for print multiple row

     first    last                    email
0  kaushal  pandey  kaushalpandey@gmail.com
1  kaushal  pandey  kaushalpandey@gmail.com
2  kaushal  pandey  kaushalpandey@gmail.com

In [21]:
df.iloc[[0, 1], 2]
#[0,1] row
# 2 is column

0    kaushalpandey@gmail.com
1    kaushalpandey@gmail.com
Name: email, dtype: object

In [22]:
df

     first    last                    email
0  kaushal  pandey  kaushalpandey@gmail.com
1  kaushal  pandey  kaushalpandey@gmail.com
2  kaushal  pandey  kaushalpandey@gmail.com

In [24]:
df.loc[[0, 1], ['email', 'first']]

                     email    first
0  kaushalpandey@gmail.com  kaushal
1  kaushalpandey@gmail.com  kaushal

In [25]:
df.loc[[0, 1], ['email']]

                     email
0  kaushalpandey@gmail.com
1  kaushalpandey@gmail.com

In [26]:
df = pd.read_csv('E:/csv_file/CoreySchafer/survey_results_public.csv')
schema_df = pd.read_csv('E:/csv_file/CoreySchafer/survey_results_schema.csv')

In [27]:
df.columns

Index(['Respondent', 'MainBranch', 'Hobbyist', 'Age', 'Age1stCode', 'CompFreq',
       'CompTotal', 'ConvertedComp', 'Country', 'CurrencyDesc',
       'CurrencySymbol', 'DatabaseDesireNextYear', 'DatabaseWorkedWith',
       'DevType', 'EdLevel', 'Employment', 'Ethnicity', 'Gender', 'JobFactors',
       'JobSat', 'JobSeek', 'LanguageDesireNextYear', 'LanguageWorkedWith',
       'MiscTechDesireNextYear', 'MiscTechWorkedWith',
       'NEWCollabToolsDesireNextYear', 'NEWCollabToolsWorkedWith', 'NEWDevOps',
       'NEWDevOpsImpt', 'NEWEdImpt', 'NEWJobHunt', 'NEWJobHuntResearch',
       'NEWLearn', 'NEWOffTopic', 'NEWOnboardGood', 'NEWOtherComms',
       'NEWOvertime', 'NEWPurchaseResearch', 'NEWPurpleLink', 'NEWSOSites',
       'NEWStuck', 'OpSys', 'OrgSize', 'PlatformDesireNextYear',
       'PlatformWorkedWith', 'PurchaseWhat', 'Sexuality', 'SOAccount',
       'SOComm', 'SOPartFreq', 'SOVisitFreq', 'SurveyEase', 'SurveyLength',
       'Trans', 'UndergradMajor', 'WebframeDesireNextYear',
       'WebframeWorkedWith', 'WelcomeChange', 'WorkWeekHrs', 'YearsCode',
       'YearsCodePro'],
      dtype='object')

In [28]:
df['Hobbyist']

0        Yes
1         No
2        Yes
3        Yes
4        Yes
        ...
64456    Yes
64457    Yes
64458    Yes
64459    Yes
64460    Yes
Name: Hobbyist, Length: 64461, dtype: object

In [29]:
df['Hobbyist'].value_counts()

Yes    50388
No     14028
Name: Hobbyist, dtype: int64

In [32]:
df.loc[1,'Hobbyist']

'No'

In [35]:
df.loc[[1,2,3], 'Hobbyist']

1     No
2    Yes
3    Yes
Name: Hobbyist, dtype: object

In [36]:
df.loc[0:2, 'Hobbyist']

0    Yes
1     No
2    Yes
Name: Hobbyist, dtype: object

In [37]:
df.loc[0:2, 'Hobbyist':'Employment']

,Hobbyist,Age,Age1stCode,CompFreq,CompTotal,ConvertedComp,Country,CurrencyDesc,CurrencySymbol,DatabaseDesireNextYear,DatabaseWorkedWith,DevType,EdLevel,Employment
0,Yes,NaN,13,Monthly,NaN,NaN,Germany,European Euro,EUR,Microsoft SQL Server,Elasticsearch;Microsoft SQL Server;Oracle,"Developer, desktop or enterprise applications;...","Master’s degree (M.A., M.S., M.Eng., MBA, etc.)","Independent contractor, freelancer, or self-em..."
1,No,NaN,19,NaN,NaN,NaN,United Kingdom,Pound sterling,GBP,NaN,NaN,"Developer, full-stack;Developer, mobile","Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Employed full-time
2,Yes,NaN,15,NaN,NaN,NaN,Russian Federation,NaN,NaN,NaN,NaN,NaN,NaN,NaN